<template>
  <v-container class="mt-6">
    <div class="pt-6">
      <h2 class="mt-6">ДОГОВОР ПУБЛИЧНОЙ ОФЕРТЫ</h2>
      <p>
        Настоящий договор адресован физическим и юридическим лицам, (далее
        «Покупатель»). Покупатель и ИП «Рамазан», далее («Продавец») заключили
        настоящий договор (далее – «Договор»), о нижеследующем:
      </p>
      <h4>1. Общие положения</h4>
      <br />
      <p>
        1.1. В соответствии со статьей 395 Гражданского Кодекса Республики
        Казахстан (далее - ГК РК) данный документ является публичной офертой, и
        в случае принятия изложенных ниже условий Покупатель, который производит
        акцепт данной оферты, осуществляет оплату Товара Продавца в соответствии
        с условиями настоящего Договора. В соответствии с пунктом 3 статьи 396
        ГК РК, оплата Товара Покупателем является акцептом оферты, что считается
        равносильным заключению Договора на условиях, изложенных в оферте.
      </p>
      <p>
        1.2. В настоящей оферте, если контекст не требует иного, нижеприведенные
        термины имеют следующие значения:
      </p>
      <p>
        • «Оферта» — публичное предложение Продавца, адресованное любому
        физическому/юридическому лицу, заключить с ним договор купли-продажи на
        существующих условиях, содержащихся в Договоре, включая все его
        приложения.
      </p>
      <p>
        • «Продавец» — компания, реализующая Товар, представленный на
        интернет-сайте www.giftcity.kz
      </p>
      <p>
        • «Покупатель» — физическое или юридическое лицо, заключившее с
        Продавцом Договор на условиях, содержащихся в Договоре.
      </p>
      <p>
        • «Акцепт» — полное и безоговорочное принятие Покупателем условий
        Договора.
      </p>
      <p>
        • «Товар» — перечень наименований ассортимента, представленный на
        интернет-сайте www.giftcity.kz
      </p>
      <p>
        • «Заказ» — отдельные позиции из ассортиментного перечня Товара,
        указанные Покупателем при размещении заявки на
        интернет-сайте www.giftcity.kz
      </p>
      <p>
        • «Сайт» – совокупность электронных документов (файлов) Продавца,
        доступных в сети Интернет по адресу www.giftcity.kz.
      </p>
      <h4>2. Предмет договора</h4>

      <p>
        2.1. Продавец продает Товар в соответствии с действующим прейскурантом,
        опубликованным на интернет-сайте Продавца, а Покупатель производит
        оплату и принимает Товар в соответствии с условиями настоящего Договора.
      </p>
      <p>
        2.2. Настоящий Договор и все приложения к нему являются официальными
        документами Продавца и неотъемлемой частью Оферты.
      </p>
      <h4>3. Размещение Заказа</h4>

      <p>
        3.1. Заказ Товара осуществляется Покупателем через интернет
        сайт www.giftcity.kz.
      </p>
      <p>
        3.2. При регистрации (размещении) Заказа на интернет-сайте Продавца,
        Покупатель обязуется предоставить регистрационную информацию о себе.
        Поля обязательные к заполнению выделены *. В случае если Покупатель
        сделал заказ, но не заполнил указанные обязательные поля, Продавец по
        своему усмотрению может приостановить либо отказать в исполнении заказа.
      </p>
      <p>
        3.3. Принятие Покупателем условий настоящего Договора осуществляется
        посредством внесения Покупателем соответствующих данных в
        регистрационную форму на интернет-сайте Покупатель имеет право
        редактировать регистрационную информацию о себе. Продавец обязуется не
        сообщать регистрационные данные Покупателя на
        Интернет-сайте www.giftcity.kz, а также иную информацию, касающуюся
        личных данных Покупателя, лицам, не имеющим отношения к исполнению
        Заказа. Утвердив Заказ выбранного Товара, Покупатель предоставляет
        необходимую информацию для доставки товара.
      </p>
      <p>
        3.4. Покупатель несет ответственность за содержание и достоверность
        информации, предоставленной при размещении Заказа.
      </p>
      <p>
        3.5. Все информационные материалы, представленные на
        сайте www.giftcity.kz, носят справочный характер и не могут в
        полной мере передавать достоверную информацию об определенных свойствах
        и характеристиках Товара, таких как: цена, цвет, форма, размер и
        упаковка. В случае возникновения у Покупателя вопросов, касающихся
        свойств и характеристик Товара, перед размещением Заказа ему необходимо
        обратиться за консультацией по контактам, представленных на сайте
        Продавца.
      </p>
      <h4>4. Сроки исполнения Заказа</h4>
      <p>
        4.1. Продавец подготавливает заказ в максимально короткие сроки, но не
        более 3 (трех) рабочих дней. Срок исполнения Заказа зависит от наличия
        заказанных позиций Товара на складе Продавца и времени, необходимого на
        обработку Заказа. Срок исполнения Заказа в исключительных случаях может
        быть оговорен с Покупателем индивидуально в зависимости от характеристик
        и количества заказанного Товара. В случае отсутствия части Заказа на
        складе Продавца, в том числе по причинам, не зависящим от последнего,
        Продавец вправе аннулировать указанный Товар из Заказа Покупателя.
        Продавец обязуется уведомить Покупателя об изменении комплектности его
        Заказа путем направления сообщения на электронный адрес или в
        мессенджерах мобильного телефона, указанный на интернет-сайте.
      </p>
      <p>
        4.2. Заказ считается исполненным в момент его передачи Покупателю.
        Расписываясь в товарной накладной предоставляемой курьерскими/почтовыми
        службами Продавца при получении Товара, Покупатель подтверждает
        исполнение Заказа.
      </p>
      <p>
        4.3. Стоимость и условия доставки Заказа Покупатель уточняет на
        интернет-сайте Продавца.
      </p>
      <p>
        4.4. В случае предоставления Покупателем недостоверной информации о его
        контактных данных или составе Заказа, Продавец за ненадлежащее
        исполнение Заказа ответственности не несет.
      </p>
      <h4>5. Оплата Заказа</h4>
      <p>
        5.1. Оплата исполненного Заказа по выбору Покупателя может
        осуществляться:
      </p>
      <p>
        1) путем передачи Покупателем наличных денежных средств сотруднику
        курьерской службы доставки Продавца;
      </p>
      <p>2) путем перечисления денежных средств на расчетный счет Продавца;</p>
      <p>
        3) путем перечисления Покупателем денежных средств в режиме онлайн через
        систему электронных платежей ePay АО «Народный Банк Казахстана»
        картами VISA, MasterCard.
      </p>
      <p>
        4) путем перечисления Покупателем денежных средств в режиме онлайн через
        систему электронных платежей Kaspi.kz Запрещены: - транзакции по
        карточкам AmEx; - SSL транзакции; - транзакции по корпоративным
        карточкам. Разрешены транзакции только по карточкам, эмитированным в
        следующих странах: KAZ, RUS, AZE, TJK, UKR, UZB, TKM, KGZ, ARM, BLR,
        GEO. 5.2. Цена на каждую позицию Товара отображается на
        интернет-сайте www.giftcity.kz. В случае изменения цены на
        заказанные позиции Товара, Продавец обязуется в кратчайшие сроки
        проинформировать Покупателя о таком изменении. Покупатель вправе
        подтвердить либо аннулировать Заказ. В случае отсутствия связи с
        Покупателем Заказ считается аннулированным в течение 1 (одного)
        календарного дня с момента размещения.
      </p>
      <p>
        5.3. Цены на любые позиции Товара, указанные на интернет-сайте, могут
        быть изменены Продавцом в одностороннем порядке без уведомления
        Покупателя.
      </p>
      <p>
        5.4. Оплата Покупателем самостоятельно размещенного Заказа на
        интернет-сайте означает согласие с Условиями настоящего Договора. День
        оплаты Заказа является датой заключения Договора оферты между Продавцом
        и Покупателем.
      </p>
      <h4>6. Возврат Заказа</h4>
      <p>
        6.1. В течение одного дня с момента передачи товара надлежащего
        качества, Покупатель вправе обменять купленный товар на аналогичный
        товар другого размера, формы, габарита, фасона, расцветки, комплектации
        и т.п., произведя, в случае разницы в цене, необходимый перерасчет с
        продавцом. При отсутствии необходимого для обмена товара у Продавца
        Покупатель вправе возвратить приобретенный товар Продавцу и получить
        уплаченную за него денежную сумму.
      </p>
      <p>
        6.2. В случае доставки Продавцом Товара ненадлежащего качества,
        Покупатель обязуется предоставить Товар Продавцу в порядке и на условиях
        предусмотренным в интернет-сайте Продавца, в максимально короткие сроки
        с момента покупки для осуществления проверки качества Товара.
      </p>
      <p>
        6.3. Право собственности на Заказ, а также риск его повреждения
        переходят к Покупателю с момента передачи Товара Покупателю.
      </p>
      <h4>7. Порядок разрешения споров</h4>
      <p>
        7.1. Споры и разногласия, которые могут возникнуть при исполнении
        настоящего Договора, будут по возможности разрешаться путем переговоров
        между сторонами.
      </p>
      <p>
        7.2. Сторона, чьи интересы были нарушены либо нарушаются, направляет
        другой Стороне письменную претензию. Сторона получившая претензию,
        обязана дать письменный ответ в течение 10 (десяти) календарных дней с
        даты получения претензии.
      </p>
      <p>
        7.3. В случае невозможности разрешения споров путем переговоров и после
        реализации обязательной претензионной процедуры, споры разрешаются в
        судебном порядке в  Специализированном межрайонном экономическом суде г.
        Алматы в соответствие с действующим законодательством Республики
        Казахстан.
      </p>
      <h4>8. Обстоятельства непреодолимой силы</h4>
      <p>
        8.1. В случае возникновения обстоятельств непреодолимой силы, таких как
        стихийные бедствия, военные действия, забастовки, принятие
        уполномоченными органами ограничивающих и запрещающих актов, Сторона для
        которой выполнение обязательств по настоящему Договору в силу
        вышеперечисленных причин стала невозможной извещает оппонента в любой
        форме позволяющей подтвердить  получения данного сообщения в течение 3
        (трех) календарных дней с даты начала обстоятельств непреодолимой силы.
      </p>
      <h4>9. Заключительные положения</h4>
      <p>
        9.1. Настоящим Покупатель соглашается с обязательными условиями
        настоящего Договора публичной оферты.
      </p>
      <p>
        9.2. В соответствии с условиями настоящего Договора публичной оферты
        Продавец имеет право отказать в размещении Заказа лицам, выражающим
        несогласие с условиями настоящего Договора.
      </p>
      <p>
        9.3. Договор исчерпывающим образом оговаривает и содержит все
        существенные и иные условия, которых должны придерживаться Стороны при
        исполнении Договора.
      </p>
      <p>
        9.4. Признание какой-либо части Договора недействительной не влечет за
        собой недействительность Договора в целом.
      </p>
      <p>
        9.5. Продавец оставляет за собой право вносить изменения в настоящее
        Соглашение, в связи с чем Покупатель обязуется регулярно отслеживать
        изменения в Соглашении, опубликованном на сайте www.giftcity.kz
      </p>
      <p>
        9.6. Во всем остальном, что не предусмотрено Договором, Стороны
        руководствуются действующим законодательством Республики Казахстан.
      </p>
    </div>
  </v-container>
</template>

<style  scoped>
    h4{
        margin-bottom: 2rem;
        margin-top: 3rem;
    }
</style>